@maveonair I'm not sure what you mean by initial setup.

Here's a simple example:

```hcl
terraform {
  required_providers {
    incus = {
      source = "lxc/incus"
    }
  }
}

resource "incus_instance" "file-test" {
  name = "file-test"
  image = "images:alpine/3.21"

  file {
    target_path = "/test"
    content = "foo"
  }
}
```

Run `tofu apply` / `terraform apply`:

```
OpenTofu will perform the following actions:

  # incus_instance.file-test will be created
  + resource "incus_instance" "file-test" {
      + config       = {}
      + ephemeral    = false
      + image        = "images:alpine/3.21"
      + ipv4_address = (known after apply)
      + ipv6_address = (known after apply)
      + mac_address  = (known after apply)
      + name         = "file-test"
      + profiles     = [
          + "default",
        ]
      + running      = true
      + status       = (known after apply)
      + target       = (known after apply)
      + type         = "container"

      + file {
          + append      = false
          + content     = "foo"
          + target_path = "/test"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

Then:

```
$ incus exec file-test cat /test
foo
```

Change the terraform config:
```hcl
terraform {
  required_providers {
    incus = {
      source = "lxc/incus"
    }
  }
}

resource "incus_instance" "file-test" {
  name = "file-test"
  image = "images:alpine/3.21"

  file {
    target_path = "/test"
    content = "bar" # the content here was changed, everything else stayed the same
  }
}
```

Apply again:
```
OpenTofu will perform the following actions:

  # incus_instance.file-test will be updated in-place
  ~ resource "incus_instance" "file-test" {
      + ipv4_address = (known after apply)
      + ipv6_address = (known after apply)
      + mac_address  = (known after apply)
        name         = "file-test"
      ~ status       = "Running" -> (known after apply)
      + target       = (known after apply)
        # (6 unchanged attributes hidden)

      - file {
          - append      = false -> null
          - content     = "foo" -> null
          - target_path = "/test" -> null
        }
      + file {
          + append      = false
          + content     = "bar"
          + target_path = "/test"
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

After applying:

```
$ incus exec file-test cat /test
foo
```

As you can see, the file did not change on the instance, even though tf reported that it would be changed (or rather that the old file would be deleted and the new file created) in the plan.

This behaviour is the same with both `v0.3.1` and `HEAD`.